DesignPatterns_Exercicios/Exercicio1_FactoryMethod/uml.dot
digraph G { rankdir=LR; node [shape=box]; Apolice [shape=box,label="<<abstract>> Apolice\n+ calcularPremio()\n+ validarCobertura()\n+ listarDocumentos()\n+ gerarResumo()"]; Auto[label="ApoliceAuto"]; Res[label="ApoliceResidencial"]; Vida[label="ApoliceVida"]; Via[label="ApoliceViagem"]; Criador [label="<<abstract>> CriadorApolice\n# criarApolice()\n+ final processarContratacao()"]; CA[label="CriadorAuto"]; CR[label="CriadorResidencial"]; CV[label="CriadorVida"]; CVi[label="CriadorViagem"]; Sel[label="SeletorCriador"]; Main[label="Main (cliente)"]; Auto->Apolice[dir=back]; Res->Apolice[dir=back]; Vida->Apolice[dir=back]; Via->Apolice[dir=back]; CA->Criador[dir=back]; CR->Criador[dir=back]; CV->Criador[dir=back]; CVi->Criador[dir=back]; Criador->Apolice[label="factory method cria"]; Main->Sel; Sel->Criador; }
